#ifndef DUAL_A2DP_PLAY_H
#define DUAL_A2DP_PLAY_H

/**
 * @brief a2dp能量检测处理函数
 */
void a2dp_energy_detect_handler(int *arg);

/* --------------------------------------------------------------------------*/
/**
 * @brief   暂停被leaudio抢掉的a2dp播歌
 *
 * @return 1:操作成功, 0:操作失败
 */
/* ----------------------------------------------------------------------------*/
u8 a2dp_suspend_by_le_audio();

/* --------------------------------------------------------------------------*/
/**
 * @brief   尝试恢复被leaudio抢掉的a2dp播歌
 *
 * @return 1:操作成功, 0:操作失败
 */
/* ----------------------------------------------------------------------------*/
u8 try_a2dp_resume_by_le_audio_preempted();

#endif
